graph(%self : __torch__.ScriptableAdapter,
      %inputs.1 : (Dict(str, Tensor))):
  %2 : bool = prim::Constant[value=1]() # export_model.py:91:23
  %3 : NoneType = prim::Constant()
  %4 : bool = prim::Constant[value=0]() # export_model.py:90:72
  %model : __torch__.detectron2.modeling.meta_arch.rcnn.GeneralizedRCNN = prim::GetAttr[name="model"](%self)
  %6 : Dict(str, Tensor) = prim::TupleUnpack(%inputs.1)
  %7 : Dict(str, Tensor)[] = prim::ListConstruct(%6)
  %15 : str = prim::Constant[value="Empty Instances does not support __len__!"]() # /tmp/detectron2gsvl5gec/tmpi2j_2njj.py:173:34
  %16 : str = prim::Constant[value="unequal value, x[0] batch dim 0 is {}, but box_list has length {}"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/poolers.py:233:11
  %17 : str = prim::Constant[value="unequal value, num_level_assignments={}, but x is list of {} Tensors"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/poolers.py:227:11
  %18 : float = prim::Constant[value=1e-08]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/poolers.py:53:70
  %19 : str = prim::Constant[value="AssertionError: The shape of the tensor in the boxes list is not correct as List[Tensor[L, 4]]"]()
  %20 : str = prim::Constant[value="AssertionError: The boxes tensor shape is not correct as Tensor[K, 5]"]()
  %21 : str = prim::Constant[value="AssertionError: proposal_boxes is None and cannot be accessed!"]()
  %22 : str = prim::Constant[value="AssertionError: pred_boxes is None and cannot be accessed!"]()
  %23 : str = prim::Constant[value="AssertionError: pred_classes is None and cannot be accessed!"]()
  %24 : int = prim::Constant[value=6]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/anchor_generator.py:44:78
  %25 : str = prim::Constant[value="Indexing on Boxes with {} failed to return a matrix!"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/boxes.py:236:29
  %26 : str = prim::Constant[value="AssertionError: Box tensor contains infinite or NaN!"]()
  %27 : int = prim::Constant[value=4000]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torchvision/ops/boxes.py:65:23
  %28 : int = prim::Constant[value=11]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torchvision/ops/boxes.py:99:47
  %29 : (str, str, str, str, str, str, str, str) = prim::Constant[value=("proposal_boxes", "objectness_logits", "pred_boxes", "scores", "pred_classes", "pred_masks", "pred_keypoints", "pred_keypoint_heatmaps")]()
  %30 : float = prim::Constant[value=0.5]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/box_regression.py:93:30
  %31 : int = prim::Constant[value=-4]()
  %32 : int = prim::Constant[value=-3]()
  %33 : str = prim::Constant[value="nearest"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/fpn.py:153:88
  %34 : float = prim::Constant[value=2.]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/fpn.py:153:78
  %35 : int = prim::Constant[value=3]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:358:40
  %36 : float = prim::Constant[value=1.0000000000000001e-05]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:179:12
  %37 : float = prim::Constant[value=0.10000000000000001]()
  %38 : str = prim::Constant[value="Expected more than 1 value per channel when training, got input size {}"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:25
  %39 : str = prim::Constant[value="ResNet takes an input of shape (N, C, H, W). Got {} instead!"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:29
  %40 : str = prim::Constant[value="stem"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:446:11
  %41 : int = prim::Constant[value=5]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3713:22
  %42 : str = prim::Constant[value="area"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3623:27
  %43 : str = prim::Constant[value="Default upsampling behavior when mode={} is changed to align_corners=False since 0.4.0. Please specify align_corners=True if the old behavior is desired. See the documentation of nn.Upsample for details."]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3632:16
  %44 : int = prim::Constant[value=9223372036854775807]()
  %45 : str = prim::Constant[value="The default behavior for interpolate/upsample with float scale_factor changed in 1.6.0 to align with other frameworks/libraries, and now uses scale_factor directly, instead of relying on the computed output size. If you wish to restore the old behavior, please set recompute_scale_factor=True. See the documentation of nn.Upsample for details. "]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3680:24
  %46 : str = prim::Constant[value="Input Error: Only 3D, 4D and 5D input Tensors supported (got {}D) for the modes: nearest | linear | bilinear | bicubic | trilinear (got {})"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:3753:8
  %47 : float = prim::Constant[value=0.]()
  %48 : int = prim::Constant[value=1]()
  %49 : str = prim::Constant[value="image"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:227:49
  %50 : bool = prim::Constant[value=0]()
  %51 : str = prim::Constant[value="square_size"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/fpn.py:124:16
  %52 : int = prim::Constant[value=2]()
  %53 : str = prim::Constant[value="AssertionError: Padding length too large"]()
  %54 : int = prim::Constant[value=0]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:30
  %55 : str = prim::Constant[value="AssertionError: "]()
  %56 : int = prim::Constant[value=-2]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:28
  %57 : int = prim::Constant[value=-1]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:47
  %58 : str = prim::Constant[value="size_divisibility"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:96:15
  %59 : str = prim::Constant[value="floor"]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:75
  %60 : int = prim::Constant[value=4]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:52
  %61 : NoneType = prim::Constant() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:206:33
  %62 : bool = prim::Constant[value=1]() # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:215:33
  %63 : str = prim::Constant[value="AssertionError: Scripting is not supported for postprocess."]()
  %images.1 : Tensor[] = prim::ListConstruct()
  %65 : int = aten::len(%7) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:227:17
   = prim::Loop(%65, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:227:17
    block0(%66 : int):
      %x.59 : Dict(str, Tensor) = aten::__getitem__(%7, %66) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:227:17
      %68 : Tensor = aten::__getitem__(%x.59, %49) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:227:47
      %pixel_mean.2 : Tensor = prim::GetAttr[name="pixel_mean"](%model)
      %70 : Device = prim::device(%pixel_mean.2)
      %71 : Tensor = aten::to(%68, %70, %61, %50, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:146:11
      %72 : Tensor[] = aten::append(%images.1, %71) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:227:17
      -> (%62)
  %images.5 : Tensor[] = prim::ListConstruct()
  %74 : int = aten::len(%images.1) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:228:17
   = prim::Loop(%74, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:228:17
    block0(%75 : int):
      %x.50 : Tensor = aten::__getitem__(%images.1, %75) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:228:17
      %pixel_mean.1 : Tensor = prim::GetAttr[name="pixel_mean"](%model)
      %78 : Tensor = aten::sub(%x.50, %pixel_mean.1, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:228:19
      %pixel_std : Tensor = prim::GetAttr[name="pixel_std"](%model)
      %80 : Tensor = aten::div(%78, %pixel_std) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:228:19
      %81 : Tensor[] = aten::append(%images.5, %80) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/meta_arch/rcnn.py:228:17
      -> (%62)
  %backbone.1 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%model)
  %_size_divisibility : int = prim::GetAttr[name="_size_divisibility"](%backbone.1)
  %backbone : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%model)
  %_square_pad : int = prim::GetAttr[name="_square_pad"](%backbone)
  %86 : Dict(str, int) = prim::DictConstruct(%51, %_square_pad)
  %87 : int = aten::len(%images.5) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:15
  %88 : bool = aten::gt(%87, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:15
   = prim::If(%88) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:8
    block0():
      -> ()
    block1():
       = prim::RaiseException(%55) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:81:8
      -> ()
  %89 : int = aten::len(%images.5) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:83:8
   = prim::Loop(%89, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:83:8
    block0(%90 : int):
      %t.4 : Tensor = aten::__getitem__(%images.5, %90) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:83:8
      %92 : int[] = aten::size(%t.4) # <string>:7:9
      %93 : int[] = aten::slice(%92, %61, %56, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:19
      %94 : Tensor = aten::__getitem__(%images.5, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:35
      %95 : int[] = aten::size(%94) # <string>:7:9
      %96 : int[] = aten::slice(%95, %61, %56, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:35
      %97 : bool = aten::eq(%93, %96) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:19
       = prim::If(%97) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:12
        block0():
          -> ()
        block1():
          %98 : int[] = aten::size(%t.4) # <string>:7:9
          %99 : str = aten::str(%98) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:12
          %100 : str = aten::add(%55, %99) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:12
           = prim::RaiseException(%100) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:85:12
          -> ()
      -> (%62)
  %image_sizes.1 : (int, int)[] = prim::ListConstruct()
  %102 : int = aten::len(%images.5) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:22
   = prim::Loop(%102, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:22
    block0(%103 : int):
      %im.1 : Tensor = aten::__getitem__(%images.5, %103) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:22
      %105 : int[] = aten::size(%im.1) # <string>:7:9
      %106 : int = aten::__getitem__(%105, %56) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:24
      %107 : int[] = aten::size(%im.1) # <string>:7:9
      %108 : int = aten::__getitem__(%107, %57) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:38
      %109 : (int, int) = prim::TupleConstruct(%106, %108)
      %110 : (int, int)[] = aten::append(%image_sizes.1, %109) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:87:22
      -> (%62)
  %image_sizes_tensor.1 : Tensor[] = prim::ListConstruct()
  %112 : int = aten::len(%image_sizes.1) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:29
   = prim::Loop(%112, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:29
    block0(%113 : int):
      %x.55 : (int, int) = aten::__getitem__(%image_sizes.1, %113) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:29
      %115 : int, %116 : int = prim::TupleUnpack(%x.55)
      %117 : int[] = prim::ListConstruct(%115, %116)
      %118 : Tensor = aten::as_tensor(%117, %61, %61) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:25:15
      %119 : Tensor[] = aten::append(%image_sizes_tensor.1, %118) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:88:29
      -> (%62)
  %120 : Tensor = aten::stack(%image_sizes_tensor.1, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:89:19
  %121 : Tensor, %122 : Tensor = aten::max(%120, %54, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:89:19
  %square_size.1 : int = aten::get(%86, %51, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:92:26
  %124 : bool = aten::gt(%square_size.1, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:93:15
   = prim::If(%124) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:93:12
    block0():
      %125 : Tensor = aten::select(%121, %54, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:95:16
      %126 : int = prim::dtype(%125)
      %127 : Device = prim::device(%125)
      %128 : Tensor = aten::tensor(%square_size.1, %126, %127, %50)
      %129 : Tensor = aten::copy_(%125, %128, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:95:16
      %130 : Tensor = aten::select(%121, %54, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:95:30
      %131 : int = prim::dtype(%130)
      %132 : Device = prim::device(%130)
      %133 : Tensor = aten::tensor(%square_size.1, %131, %132, %50)
      %134 : Tensor = aten::copy_(%130, %133, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:95:16
      -> ()
    block1():
      -> ()
  %135 : bool = aten::__contains__(%86, %58) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:96:15
  %size_divisibility.27 : int = prim::If(%135) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:96:12
    block0():
      %size_divisibility.3 : int = aten::__getitem__(%86, %58) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:97:36
      -> (%size_divisibility.3)
    block1():
      -> (%_size_divisibility)
  %138 : bool = aten::gt(%size_divisibility.27, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:98:11
  %max_size : Tensor = prim::If(%138) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:98:8
    block0():
      %140 : int = aten::sub(%size_divisibility.27, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:36
      %141 : Tensor = aten::add(%121, %140, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:24
      %142 : Tensor = aten::div(%141, %size_divisibility.27, %59) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:24
      %max_size.9 : Tensor = aten::mul(%142, %size_divisibility.27) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:101:24
      -> (%max_size.9)
    block1():
      -> (%121)
  %144 : Tensor = aten::to(%max_size, %60, %50, %50, %61) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:105:34
  %max_size.25 : int[] = prim::tolist(%144, %48, %54)
  %146 : int = aten::len(%images.5) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:110:11
  %147 : bool = aten::eq(%146, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:110:11
  %batched_imgs : Tensor = prim::If(%147) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:110:8
    block0():
      %image_size.2 : (int, int) = aten::__getitem__(%image_sizes.1, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:113:25
      %150 : int = aten::__getitem__(%max_size.25, %57) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:114:31
      %151 : int = prim::TupleIndex(%image_size.2, %48)
      %152 : int = aten::sub(%150, %151) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:114:31
      %153 : int = aten::__getitem__(%max_size.25, %56) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:114:64
      %154 : int = prim::TupleIndex(%image_size.2, %54)
      %155 : int = aten::sub(%153, %154) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:114:64
      %padding_size.1 : int[] = prim::ListConstruct(%54, %152, %54, %155)
      %157 : Tensor = aten::__getitem__(%images.5, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:115:33
      %158 : int = aten::dim(%157) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:4172:28
      %159 : bool = aten::le(%52, %158) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:4172:11
       = prim::If(%159) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:4172:4
        block0():
          -> ()
        block1():
           = prim::RaiseException(%53) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:4172:4
          -> ()
      %160 : Tensor = aten::constant_pad_nd(%157, %padding_size.1, %47) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:4174:15
      %batched_imgs.1 : Tensor = aten::unsqueeze_(%160, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:115:27
      -> (%batched_imgs.1)
    block1():
      %162 : int = aten::len(%images.5) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:27
      %163 : int[] = prim::ListConstruct(%162)
      %164 : Tensor = aten::__getitem__(%images.5, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:48
      %165 : int[] = aten::size(%164) # <string>:7:9
      %166 : int[] = aten::slice(%165, %61, %56, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:48
      %167 : int[] = aten::list(%166) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:43
      %168 : int[] = aten::add(%163, %167) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:26
      %169 : int[] = aten::list(%max_size.25) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:73
      %batch_shape.1 : int[] = aten::add(%168, %169) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:118:26
      %171 : Tensor = aten::__getitem__(%images.5, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:122:27
      %batched_imgs.3 : Tensor = aten::new_full(%171, %batch_shape.1, %47, %61, %61, %61, %61) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:122:27
      %173 : Tensor = aten::__getitem__(%images.5, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:123:58
      %174 : Device = prim::device(%173)
      %batched_imgs.7 : Tensor = aten::to(%batched_imgs.3, %174, %61, %50, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:146:11
      %176 : int = aten::len(%images.5) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:124:12
      %177 : int = aten::len(%batched_imgs.7) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:124:12
      %178 : int[] = prim::ListConstruct(%176, %177)
      %179 : int = prim::min(%178) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:124:12
       = prim::Loop(%179, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:124:12
        block0(%180 : int):
          %img.1 : Tensor = aten::__getitem__(%images.5, %180) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:124:12
          %pad_img.1 : Tensor = aten::select(%batched_imgs.7, %54, %180) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:124:12
          %183 : int[] = aten::size(%img.1) # <string>:7:9
          %184 : int = aten::__getitem__(%183, %56) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:125:31
          %185 : Tensor = aten::slice(%pad_img.1, %56, %61, %184, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:125:16
          %186 : int[] = aten::size(%img.1) # <string>:7:9
          %187 : int = aten::__getitem__(%186, %57) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:125:48
          %188 : Tensor = aten::slice(%185, %57, %61, %187, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:125:16
          %189 : Tensor = aten::copy_(%188, %img.1, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:125:16
          -> (%62)
      -> (%batched_imgs.7)
  %190 : Tensor = aten::contiguous(%batched_imgs, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/structures/image_list.py:127:25
  %images.2 : __torch__.detectron2.structures.image_list.ImageList = prim::CreateObject()
   = prim::SetAttr[name="tensor"](%images.2, %190)
   = prim::SetAttr[name="image_sizes"](%images.2, %image_sizes.1)
  %backbone.2 : __torch__.detectron2.modeling.backbone.fpn.FPN = prim::GetAttr[name="backbone"](%model)
  %tensor.43 : Tensor = prim::GetAttr[name="tensor"](%images.2)
  %bottom_up : __torch__.detectron2.modeling.backbone.resnet.ResNet = prim::GetAttr[name="bottom_up"](%backbone.2)
  %195 : int = aten::dim(%tensor.43) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:15
  %196 : bool = aten::eq(%195, %60) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:15
   = prim::If(%196) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:8
    block0():
      -> ()
    block1():
      %197 : int[] = aten::size(%tensor.43) # <string>:7:9
      %198 : str = aten::format(%39, %197) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:29
      %199 : str = aten::add(%55, %198) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:8
       = prim::RaiseException(%199) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:443:8
      -> ()
  %bottom_up_features.1 : Dict(str, Tensor) = prim::DictConstruct()
  %stem : __torch__.detectron2.modeling.backbone.resnet.BasicStem = prim::GetAttr[name="stem"](%bottom_up)
  %conv1.2 : __torch__.detectron2.layers.wrappers.Conv2d = prim::GetAttr[name="conv1"](%stem)
  %weight.14 : Tensor = prim::GetAttr[name="weight"](%conv1.2)
  %bias.14 : Tensor? = prim::GetAttr[name="bias"](%conv1.2)
  %205 : int[] = prim::ListConstruct(%52, %52)
  %206 : int[] = prim::ListConstruct(%35, %35)
  %207 : int[] = prim::ListConstruct(%48, %48)
  %x.63 : Tensor = aten::conv2d(%tensor.43, %weight.14, %bias.14, %205, %206, %207, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:111:12
  %norm.7 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="norm"](%conv1.2)
  %training.14 : bool = prim::GetAttr[name="training"](%norm.7)
   = prim::If(%training.14) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:145:11
    block0():
      %num_batches_tracked.14 : Tensor = prim::GetAttr[name="num_batches_tracked"](%norm.7)
      %212 : Tensor = aten::add(%num_batches_tracked.14, %48, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:148:43
       = prim::SetAttr[name="num_batches_tracked"](%norm.7, %212)
      -> ()
    block1():
      -> ()
  %training.16 : bool = prim::GetAttr[name="training"](%norm.7)
  %running_mean.7 : Tensor = prim::GetAttr[name="running_mean"](%norm.7)
  %running_var.7 : Tensor = prim::GetAttr[name="running_var"](%norm.7)
  %weight.16 : Tensor = prim::GetAttr[name="weight"](%norm.7)
  %bias.16 : Tensor = prim::GetAttr[name="bias"](%norm.7)
   = prim::If(%training.16) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2279:4
    block0():
      %218 : int[] = aten::size(%x.63) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2280:27
      %size_prods.7 : int = aten::__getitem__(%218, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2244:17
      %220 : int = aten::len(%218) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %221 : int = aten::sub(%220, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %size_prods.9 : int = prim::Loop(%221, %62, %size_prods.7) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:4
        block0(%i.61 : int, %size_prods.32 : int):
          %225 : int = aten::add(%i.61, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:27
          %226 : int = aten::__getitem__(%218, %225) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:22
          %size_prods.34 : int = aten::mul(%size_prods.32, %226) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:8
          -> (%62, %size_prods.34)
      %228 : bool = aten::eq(%size_prods.9, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:7
       = prim::If(%228) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:4
        block0():
          %229 : str = aten::format(%38, %218) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:25
           = prim::RaiseException(%229) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %x.97 : Tensor = aten::batch_norm(%x.63, %weight.16, %bias.16, %running_mean.7, %running_var.7, %training.16, %37, %36, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2282:11
  %x.75 : Tensor = aten::relu_(%x.97) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:357:12
  %232 : int[] = prim::ListConstruct(%35, %35)
  %233 : int[] = prim::ListConstruct(%52, %52)
  %234 : int[] = prim::ListConstruct(%48, %48)
  %235 : int[] = prim::ListConstruct(%48, %48)
  %x.93 : Tensor = aten::max_pool2d(%x.75, %232, %233, %234, %235, %50) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:719:11
  %_out_features.1 : str[] = prim::GetAttr[name="_out_features"](%bottom_up)
  %238 : bool = aten::__contains__(%_out_features.1, %40) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:446:11
   = prim::If(%238) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:446:8
    block0():
       = aten::_set_item(%bottom_up_features.1, %40, %x.93) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:447:12
      -> ()
    block1():
      -> ()
  %stage_names : (str, str, str, str) = prim::GetAttr[name="stage_names"](%bottom_up)
  %name.1 : str, %name.7 : str, %name.13 : str, %name.19 : str = prim::TupleUnpack(%stage_names)
  %stages : __torch__.torch.nn.modules.container.ModuleList = prim::GetAttr[name="stages"](%bottom_up)
  %_0.1 : __torch__.torch.nn.modules.container.Sequential = prim::GetAttr[name="0"](%stages)
  %_1.1 : __torch__.torch.nn.modules.container.___torch_mangle_15.Sequential = prim::GetAttr[name="1"](%stages)
  %_2.1 : __torch__.torch.nn.modules.container.___torch_mangle_24.Sequential = prim::GetAttr[name="2"](%stages)
  %_3.1 : __torch__.torch.nn.modules.container.___torch_mangle_33.Sequential = prim::GetAttr[name="3"](%stages)
  %_0.3 : __torch__.detectron2.modeling.backbone.resnet.BottleneckBlock = prim::GetAttr[name="0"](%_0.1)
  %_1.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_5.BottleneckBlock = prim::GetAttr[name="1"](%_0.1)
  %_2.3 : __torch__.detectron2.modeling.backbone.resnet.___torch_mangle_5.BottleneckBlock = prim::GetAttr[name="2"](%_0.1)
  %conv1.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_2.Conv2d = prim::GetAttr[name="conv1"](%_0.3)
  %weight.18 : Tensor = prim::GetAttr[name="weight"](%conv1.4)
  %bias.18 : Tensor? = prim::GetAttr[name="bias"](%conv1.4)
  %255 : int[] = prim::ListConstruct(%48, %48)
  %256 : int[] = prim::ListConstruct(%54, %54)
  %257 : int[] = prim::ListConstruct(%48, %48)
  %x.73 : Tensor = aten::conv2d(%x.93, %weight.18, %bias.18, %255, %256, %257, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:111:12
  %norm.9 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="norm"](%conv1.4)
  %training.18 : bool = prim::GetAttr[name="training"](%norm.9)
   = prim::If(%training.18) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:145:11
    block0():
      %num_batches_tracked.16 : Tensor = prim::GetAttr[name="num_batches_tracked"](%norm.9)
      %262 : Tensor = aten::add(%num_batches_tracked.16, %48, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:148:43
       = prim::SetAttr[name="num_batches_tracked"](%norm.9, %262)
      -> ()
    block1():
      -> ()
  %training.20 : bool = prim::GetAttr[name="training"](%norm.9)
  %running_mean.9 : Tensor = prim::GetAttr[name="running_mean"](%norm.9)
  %running_var.9 : Tensor = prim::GetAttr[name="running_var"](%norm.9)
  %weight.20 : Tensor = prim::GetAttr[name="weight"](%norm.9)
  %bias.20 : Tensor = prim::GetAttr[name="bias"](%norm.9)
   = prim::If(%training.20) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2279:4
    block0():
      %268 : int[] = aten::size(%x.73) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2280:27
      %size_prods.36 : int = aten::__getitem__(%268, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2244:17
      %270 : int = aten::len(%268) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %271 : int = aten::sub(%270, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %size_prods.38 : int = prim::Loop(%271, %62, %size_prods.36) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:4
        block0(%i.10 : int, %size_prods.40 : int):
          %275 : int = aten::add(%i.10, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:27
          %276 : int = aten::__getitem__(%268, %275) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:22
          %size_prods.42 : int = aten::mul(%size_prods.40, %276) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:8
          -> (%62, %size_prods.42)
      %278 : bool = aten::eq(%size_prods.38, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:7
       = prim::If(%278) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:4
        block0():
          %279 : str = aten::format(%38, %268) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:25
           = prim::RaiseException(%279) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out.3 : Tensor = aten::batch_norm(%x.73, %weight.20, %bias.20, %running_mean.9, %running_var.9, %training.20, %37, %36, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2282:11
  %out.7 : Tensor = aten::relu_(%out.3) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:196:14
  %conv2.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_3.Conv2d = prim::GetAttr[name="conv2"](%_0.3)
  %weight.22 : Tensor = prim::GetAttr[name="weight"](%conv2.2)
  %bias.22 : Tensor? = prim::GetAttr[name="bias"](%conv2.2)
  %285 : int[] = prim::ListConstruct(%48, %48)
  %286 : int[] = prim::ListConstruct(%48, %48)
  %287 : int[] = prim::ListConstruct(%48, %48)
  %x.101 : Tensor = aten::conv2d(%out.7, %weight.22, %bias.22, %285, %286, %287, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:111:12
  %norm.11 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="norm"](%conv2.2)
  %training.22 : bool = prim::GetAttr[name="training"](%norm.11)
   = prim::If(%training.22) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:145:11
    block0():
      %num_batches_tracked.18 : Tensor = prim::GetAttr[name="num_batches_tracked"](%norm.11)
      %292 : Tensor = aten::add(%num_batches_tracked.18, %48, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:148:43
       = prim::SetAttr[name="num_batches_tracked"](%norm.11, %292)
      -> ()
    block1():
      -> ()
  %training.24 : bool = prim::GetAttr[name="training"](%norm.11)
  %running_mean.11 : Tensor = prim::GetAttr[name="running_mean"](%norm.11)
  %running_var.11 : Tensor = prim::GetAttr[name="running_var"](%norm.11)
  %weight.24 : Tensor = prim::GetAttr[name="weight"](%norm.11)
  %bias.24 : Tensor = prim::GetAttr[name="bias"](%norm.11)
   = prim::If(%training.24) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2279:4
    block0():
      %298 : int[] = aten::size(%x.101) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2280:27
      %size_prods.44 : int = aten::__getitem__(%298, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2244:17
      %300 : int = aten::len(%298) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %301 : int = aten::sub(%300, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %size_prods.46 : int = prim::Loop(%301, %62, %size_prods.44) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:4
        block0(%i.12 : int, %size_prods.48 : int):
          %305 : int = aten::add(%i.12, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:27
          %306 : int = aten::__getitem__(%298, %305) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:22
          %size_prods.50 : int = aten::mul(%size_prods.48, %306) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:8
          -> (%62, %size_prods.50)
      %308 : bool = aten::eq(%size_prods.46, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:7
       = prim::If(%308) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:4
        block0():
          %309 : str = aten::format(%38, %298) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:25
           = prim::RaiseException(%309) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out.11 : Tensor = aten::batch_norm(%x.101, %weight.24, %bias.24, %running_mean.11, %running_var.11, %training.24, %37, %36, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2282:11
  %out.15 : Tensor = aten::relu_(%out.11) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:199:14
  %conv3.2 : __torch__.detectron2.layers.wrappers.___torch_mangle_1.Conv2d = prim::GetAttr[name="conv3"](%_0.3)
  %weight.26 : Tensor = prim::GetAttr[name="weight"](%conv3.2)
  %bias.26 : Tensor? = prim::GetAttr[name="bias"](%conv3.2)
  %315 : int[] = prim::ListConstruct(%48, %48)
  %316 : int[] = prim::ListConstruct(%54, %54)
  %317 : int[] = prim::ListConstruct(%48, %48)
  %x.32 : Tensor = aten::conv2d(%out.15, %weight.26, %bias.26, %315, %316, %317, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:111:12
  %norm.13 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_0.BatchNorm2d = prim::GetAttr[name="norm"](%conv3.2)
  %training.26 : bool = prim::GetAttr[name="training"](%norm.13)
   = prim::If(%training.26) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:145:11
    block0():
      %num_batches_tracked.20 : Tensor = prim::GetAttr[name="num_batches_tracked"](%norm.13)
      %322 : Tensor = aten::add(%num_batches_tracked.20, %48, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:148:43
       = prim::SetAttr[name="num_batches_tracked"](%norm.13, %322)
      -> ()
    block1():
      -> ()
  %training.28 : bool = prim::GetAttr[name="training"](%norm.13)
  %running_mean.13 : Tensor = prim::GetAttr[name="running_mean"](%norm.13)
  %running_var.13 : Tensor = prim::GetAttr[name="running_var"](%norm.13)
  %weight.28 : Tensor = prim::GetAttr[name="weight"](%norm.13)
  %bias.28 : Tensor = prim::GetAttr[name="bias"](%norm.13)
   = prim::If(%training.28) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2279:4
    block0():
      %328 : int[] = aten::size(%x.32) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2280:27
      %size_prods.52 : int = aten::__getitem__(%328, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2244:17
      %330 : int = aten::len(%328) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %331 : int = aten::sub(%330, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %size_prods.54 : int = prim::Loop(%331, %62, %size_prods.52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:4
        block0(%i.14 : int, %size_prods.56 : int):
          %335 : int = aten::add(%i.14, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:27
          %336 : int = aten::__getitem__(%328, %335) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:22
          %size_prods.58 : int = aten::mul(%size_prods.56, %336) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:8
          -> (%62, %size_prods.58)
      %338 : bool = aten::eq(%size_prods.54, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:7
       = prim::If(%338) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:4
        block0():
          %339 : str = aten::format(%38, %328) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:25
           = prim::RaiseException(%339) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %out.19 : Tensor = aten::batch_norm(%x.32, %weight.28, %bias.28, %running_mean.13, %running_var.13, %training.28, %37, %36, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2282:11
  %shortcut.4 : __torch__.detectron2.layers.wrappers.___torch_mangle_1.Conv2d = prim::GetAttr[name="shortcut"](%_0.3)
  %weight.30 : Tensor = prim::GetAttr[name="weight"](%shortcut.4)
  %bias.30 : Tensor? = prim::GetAttr[name="bias"](%shortcut.4)
  %344 : int[] = prim::ListConstruct(%48, %48)
  %345 : int[] = prim::ListConstruct(%54, %54)
  %346 : int[] = prim::ListConstruct(%48, %48)
  %x.34 : Tensor = aten::conv2d(%x.93, %weight.30, %bias.30, %344, %345, %346, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:111:12
  %norm.15 : __torch__.torch.nn.modules.batchnorm.___torch_mangle_0.BatchNorm2d = prim::GetAttr[name="norm"](%shortcut.4)
  %training.30 : bool = prim::GetAttr[name="training"](%norm.15)
   = prim::If(%training.30) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:145:11
    block0():
      %num_batches_tracked.22 : Tensor = prim::GetAttr[name="num_batches_tracked"](%norm.15)
      %351 : Tensor = aten::add(%num_batches_tracked.22, %48, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:148:43
       = prim::SetAttr[name="num_batches_tracked"](%norm.15, %351)
      -> ()
    block1():
      -> ()
  %training.32 : bool = prim::GetAttr[name="training"](%norm.15)
  %running_mean.15 : Tensor = prim::GetAttr[name="running_mean"](%norm.15)
  %running_var.15 : Tensor = prim::GetAttr[name="running_var"](%norm.15)
  %weight.32 : Tensor = prim::GetAttr[name="weight"](%norm.15)
  %bias.32 : Tensor = prim::GetAttr[name="bias"](%norm.15)
   = prim::If(%training.32) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2279:4
    block0():
      %357 : int[] = aten::size(%x.34) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2280:27
      %size_prods.60 : int = aten::__getitem__(%357, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2244:17
      %359 : int = aten::len(%357) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %360 : int = aten::sub(%359, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %size_prods.62 : int = prim::Loop(%360, %62, %size_prods.60) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:4
        block0(%i.16 : int, %size_prods.64 : int):
          %364 : int = aten::add(%i.16, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:27
          %365 : int = aten::__getitem__(%357, %364) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:22
          %size_prods.66 : int = aten::mul(%size_prods.64, %365) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2246:8
          -> (%62, %size_prods.66)
      %367 : bool = aten::eq(%size_prods.62, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:7
       = prim::If(%367) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2247:4
        block0():
          %368 : str = aten::format(%38, %357) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:25
           = prim::RaiseException(%368) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2248:8
          -> ()
        block1():
          -> ()
      -> ()
    block1():
      -> ()
  %shortcut.6 : Tensor = aten::batch_norm(%x.34, %weight.32, %bias.32, %running_mean.15, %running_var.15, %training.32, %37, %36, %62) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2282:11
  %out.23 : Tensor = aten::add_(%out.19, %shortcut.6, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:208:8
  %input.6 : Tensor = aten::relu_(%out.23) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/modeling/backbone/resnet.py:209:14
  %conv1.6 : __torch__.detectron2.layers.wrappers.___torch_mangle_4.Conv2d = prim::GetAttr[name="conv1"](%_1.3)
  %weight.34 : Tensor = prim::GetAttr[name="weight"](%conv1.6)
  %bias.34 : Tensor? = prim::GetAttr[name="bias"](%conv1.6)
  %375 : int[] = prim::ListConstruct(%48, %48)
  %376 : int[] = prim::ListConstruct(%54, %54)
  %377 : int[] = prim::ListConstruct(%48, %48)
  %x.36 : Tensor = aten::conv2d(%input.6, %weight.34, %bias.34, %375, %376, %377, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/detectron2/layers/wrappers.py:111:12
  %norm.17 : __torch__.torch.nn.modules.batchnorm.BatchNorm2d = prim::GetAttr[name="norm"](%conv1.6)
  %training.34 : bool = prim::GetAttr[name="training"](%norm.17)
   = prim::If(%training.34) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:145:11
    block0():
      %num_batches_tracked.24 : Tensor = prim::GetAttr[name="num_batches_tracked"](%norm.17)
      %382 : Tensor = aten::add(%num_batches_tracked.24, %48, %48) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/modules/batchnorm.py:148:43
       = prim::SetAttr[name="num_batches_tracked"](%norm.17, %382)
      -> ()
    block1():
      -> ()
  %training.36 : bool = prim::GetAttr[name="training"](%norm.17)
  %running_mean.17 : Tensor = prim::GetAttr[name="running_mean"](%norm.17)
  %running_var.17 : Tensor = prim::GetAttr[name="running_var"](%norm.17)
  %weight.36 : Tensor = prim::GetAttr[name="weight"](%norm.17)
  %bias.36 : Tensor = prim::GetAttr[name="bias"](%norm.17)
   = prim::If(%training.36) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2279:4
    block0():
      %388 : int[] = aten::size(%x.36) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2280:27
      %size_prods.68 : int = aten::__getitem__(%388, %54) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2244:17
      %390 : int = aten::len(%388) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %391 : int = aten::sub(%390, %52) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:19
      %size_prods.70 : int = prim::Loop(%391, %62, %size_prods.68) # /home/aicenter/pyven/pytorch/lib/python3.8/site-packages/torch/nn/functional.py:2245:4
        block0(%i.18 : int, %size_prods.72 : int):
